Autodesk.Revit.DB.DirectContext3D.IndexBuffer.GetIndexStreamTriangle
Gets a stream that can be used to write triangle primitives into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexBuffer.GetIndexStreamLine
Gets a stream that can be used to write line segment primitives into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexBuffer.GetIndexStreamPoint
Gets a stream that can be used to write point primitives into the buffer.
Returns:
The stream that can be used to write into this buffer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the buffer is not mapped.
-or-
Thrown if the buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexBuffer.Map(System.Int32)
Maps a portion of the buffer into memory, so that indices can be written into it (see Autodesk::Revit::DB::DirectContext3D::VertexStream).
sizeInShortInts:
The size of the part of the buffer to be mapped, measured in short integers.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This IndexBuffer is not available because Revit is not currently rendering. In general, this IndexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
-or-
Thrown if the buffer is smaller than sizeInShortInts.
Since:
2017